allroom = ["101", "111", "105", "108", "201", "202", "204", "205", "208", "212", "301", "302", "304", "305", "308",
           "310", "312", "第一电教室", "第三电教室", "第五电教室", "第六电教室", "第七电教室", "第二电教室", "新平一", "新平二", "新平三", "新平四", "食品实验室",
           "生物实验室一", "生物实验室二", "生物实验室三", "生物实验室四", "无机实验室", "有机实验室", "水化实验室", "生化实验室", "第三机房", "第四机房", "第五机房", "第六机房",
           "第一机房", "第二机房", "语音室02", "第12机房", "第34机房", "新语音室", "旧语音室", "电工电子实验室", "金相实验室", "发动机构造实验室", "汽车维修实验室",
           "发动机性能实验室", "汽车电气实验室", "电喷发动机试验室", "汽车综合实习车间", "基础实验室", "冷库", "空调实验室", "制冷机械设备实验室", "小型制冷实验室", "旧平一", "综合车间",
           "绘图室"]
